app/controllers/items_controller.rb

INSERT INTO "items" ("created_at", "description", "opened", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 01 Jun 2014 14:02:22 UTC +00:00], ["description", "MyText"], ["opened", true], ["project_id", 1], ["updated_at", Sun, 01 Jun 2014 14:02:22 UTC +00:00]]
---
  def create
    @item = @project.items.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE `items` SET `description` = 'Otro item nuevo cambio', `opened` = 1, `updated_at` = '2014-05-29 16:41:44' WHERE `items`.`id` = 2
---
  def update
    respond_to do |format|
      if @item.update(item_params)

UPDATE `items` SET `opened` = 1, `updated_at` = '2014-05-29 16:10:05' WHERE `items`.`id` = 1
SELECT `items`.* FROM `items`
---
  def changeOpened
    @item.update_attributes(opened: !@item.opened)
    @items = Item.all

SELECT "items".* FROM "items" WHERE "items"."project_id" = ? AND "items"."opened" = 't'  [["project_id", 1]]
---
  def set_items_list
    @items_opened = @project.items.where(opened: true)